<table>
    <td>
        <img src="https://ciadaconcepcao.com.br/wp-content/uploads/2017/01/innohub-270x270.png" style="width: 100px">
    </td>
    <td>
        <img src="https://i.ibb.co/vJ858Kg/ets-logo2.png" style="width: 200px">
    </td>
</table>


# <center>Treinamento Iot - Módulo II</center>
## <center>Aula 4 - Pandas - parte 3</center>

<img src="https://media.giphy.com/media/EatwJZRUIv41G/giphy.gif">

Vamos continuar usando o __Pandas__ para trabalhar nosso dados.

Vamos abrir o dataset que foi salvo no final da aula anterior.

In [1]:
import pandas as pd
titanic = pd.read_csv("titanic.csv")

## Tratando valores nulos

#### Porque tratar valores nulos?

Valores nulos atrapalham a utilização de algoritmos de ML e podem atrapalhar algumas análises também.

In [2]:
titanic.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

Assim a gente consegue ver todos os dados nulos por coluna:

In [3]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Como funciona? O que acontece é que se somarmos todos os dados True/False ele vai dar a quantidade de True (que equivale a 1)

In [4]:
titanic.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

### Podemos tratar valores nulos por duas abordagens

### 1ª: Apagando Nulos

In [5]:
titanic.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [6]:
idades_nao_nulas = titanic.Age.dropna()
idades_nao_nulas.head(10)

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
Name: Age, dtype: float64

In [7]:
qnt_idades_nulas_dropna = idades_nao_nulas.isnull().sum()
print("Quantidade de valores nulos: {}".format(qnt_idades_nulas_dropna))

Quantidade de valores nulos: 0

Size x Count :
 - `size` - o tamanho total da série
 - `count` - a quantidade de valores não nulos na série

In [8]:
titanic.Age.size

891

In [9]:
titanic.Age.count()

714

In [10]:
# idades_nao_nulas.size é igual a titanic.Age.count()
idades_nao_nulas.size

714

__Atribuir uma série com os valores nulos apagados a uma coluna do DataFrame não faz sentido! A coluna vai voltar a possuir valores nulos__


Como o tamanho da Série vai ser diferente da quantidade de linhas do Dataframe, os valores que faltam na série serão colocados como __nulos__ conforme o índice.

In [11]:
titanic["AgeNotNull"] = idades_nao_nulas

In [12]:
titanic[["AgeNotNull","Age"]].head(10)

   AgeNotNull   Age
0        22.0  22.0
1        38.0  38.0
2        26.0  26.0
3        35.0  35.0
4        35.0  35.0
5         NaN   NaN
6        54.0  54.0
7         2.0   2.0
8        27.0  27.0
9        14.0  14.0

Isso acontece por causa do índice

In [13]:
idades_nao_nulas.head(10) # procure o 5

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
Name: Age, dtype: float64

### 2ª: Preenchendo com algum valor

Se desejamos preencher os valores nulos com algum valor, podemos usar o __fillna__.

__Nesse caso, se criarmos uma coluna com o resultado do `fillna`, ela realmente não terá mais valores nulos!__

In [14]:
# Preenchendo as idades nulas com -1
serie_idade_sem_nulo = titanic.Age.fillna(-1)
serie_idade_sem_nulo.isnull().sum()

0

In [15]:
serie_idade_sem_nulo.count()

891

In [16]:
titanic["AgeFillNa-1"] = serie_idade_sem_nulo

In [17]:
titanic["AgeFillNa-1"].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    -1.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: AgeFillNa-1, dtype: float64

##### Preencher com `-1` não parece ser a melhor escolha.

## Uma técnica muito usada é trocar o valor dos dados númericos é usar a média
### Vamos preencher os valores de idade nulo com a médias das idades

![alt text](https://databootcamp.nyc3.digitaloceanspaces.com/img/desafio.jpg)

In [18]:
titanic["AgeFillNaMean"] = titanic.Age.fillna(titanic.Age.mean())

In [19]:
titanic[['Age','AgeFillNaMean']].head(10)

    Age  AgeFillNaMean
0  22.0      22.000000
1  38.0      38.000000
2  26.0      26.000000
3  35.0      35.000000
4  35.0      35.000000
5   NaN      29.699118
6  54.0      54.000000
7   2.0       2.000000
8  27.0      27.000000
9  14.0      14.000000

## Agrupando

Podemos agrupar os dados baseados em uma coluna.O agrupamento aplicando uma função nos dados que estão no mesmo grupo

O `groupby` seguido de uma operação funciona da seguinte forma:
 1. Agrupa as linhas com valores iguais na coluna do agrupamento. [no código a coluna do agrupamente é colocada `groupby(COLUNA_DO_AGRUPAMENTO)`]
 2. Aplica uma função em cada grupo gerado no passo (1) que transforme todas as linhas em apenas um valor.
 3. Na imagem abaixo, estamos aplicando o groupby na coluna "X", e aplicando uma função de MÉDIA na coluna "Y". <br>
     `df.groupby("X")["Y"].mean()`
 
![groupby](https://databootcamp.nyc3.digitaloceanspaces.com/img/groupby.png)

In [20]:
# Agrupando pessoas por sexo
pessoas_por_sexo = titanic.groupby("Sex").count()
pessoas_por_sexo.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeNotNull,AgeFillNa-1,AgeFillNaMean
Sex,,,,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312,261,314,314
male,577,577,577,577,453,577,577,577,577,107,577,453,577,577

O resultado foi um Dataframe, que mostra a quantidade de dados não nulos em cada coluna dos grupos das cabines.

Se quisermos apenas o valor de pessoas por cabine, basta selecionarmos uma coluna que tenha todos os dados não nulos (Já que vimos que o `count()` conta apenas os nãos nulos)

In [21]:
# Quantas pessoas tem em cada cabine?
pessoas_por_cabine = titanic.groupby("Cabin")["PassengerId"].count()
pessoas_por_cabine.head(20)

Cabin
A10     1
A14     1
A16     1
A19     1
A20     1
A23     1
A24     1
A26     1
A31     1
A32     1
A34     1
A36     1
A5      1
A6      1
A7      1
B101    1
B102    1
B18     2
B19     1
B20     2
Name: PassengerId, dtype: int64

### Outra maneira é substituir o `count` por `size`, então podemos contar a quantidade de elementos em qualquer coluna, mesmo com valores nulos

In [22]:
# A coluna Age tem valores nulos. Podemos usar o "size" para contar por ela
pessoas_por_cabine = titanic.groupby("Cabin")["Age"].size()
pessoas_por_cabine.head(20)

Cabin
A10     1
A14     1
A16     1
A19     1
A20     1
A23     1
A24     1
A26     1
A31     1
A32     1
A34     1
A36     1
A5      1
A6      1
A7      1
B101    1
B102    1
B18     2
B19     1
B20     2
Name: Age, dtype: int64

#### Outra maneira de agrupar é pela soma
### Qual a idade somada das pessoas em cada cabine?

In [23]:
soma_idade = titanic.groupby("Cabin")["Age"].sum()
soma_idade.head(20)

Cabin
A10     36.0
A14      0.0
A16     48.0
A19      0.0
A20     49.0
A23     80.0
A24     31.0
A26     56.0
A31     40.0
A32      0.0
A34      4.0
A36     39.0
A5      71.0
A6      28.0
A7      56.0
B101    35.0
B102     0.0
B18     60.0
B19     61.0
B20     48.0
Name: Age, dtype: float64

### Também podemos agrupar pela média

In [24]:
# Qual a idade média das pessoas de cada sexo?
media_idade = titanic.groupby("Sex")["Age"].mean()
media_idade.head(20)

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

#### Existe uma maneira mais livre para agruparmos. Podemos usar o __apply!__

### Usando o apply para contar os passageiros por cabine

In [25]:
def contar_pessoas(registros_agrupados):
    return registros_agrupados["PassengerId"].size


pessoas_por_cabine_apply = titanic.groupby("Cabin").apply(contar_pessoas)
pessoas_por_cabine_apply.head(10)

Cabin
A10    1
A14    1
A16    1
A19    1
A20    1
A23    1
A24    1
A26    1
A31    1
A32    1
dtype: int64

### Vamos fazer o agrupamento por cabine somando as idades usando o apply

![alt text](https://databootcamp.nyc3.digitaloceanspaces.com/img/desafio.jpg)

In [26]:
def contar_pessoas(registros_agrupados):
    return registros_agrupados.Age.sum()


soma_idade_apply_certo = titanic.groupby("Cabin").apply(contar_pessoas)
soma_idade_apply_certo.describe()

count    147.000000
mean      45.091293
std       26.172014
min        0.000000
25%       28.500000
50%       44.000000
75%       59.250000
max      130.000000
dtype: float64

### Vamos voltar ao caso de contar quantos homens e mulheres temos

In [27]:
# Usando o count()
soma_idade_apply_certo = titanic.groupby("Sex")["PassengerId"].count()
soma_idade_apply_certo

Sex
female    314
male      577
Name: PassengerId, dtype: int64

In [28]:
# Usando apply
def count_sex(registros):
    return registros["Sex"].count()

titanic.groupby("Sex").apply(count_sex)

Sex
female    314
male      577
dtype: int64

### Desafio
Lembram que não ficou muito bom quando colocamos a média geral da idade nas idades nulas?

### Vamos tentar melhorar a média das idades!


**Vamos preencher os nulos de maneira que se o passageiro for mulher esse recebe a idade media das mulheres.
Se o passageiro for homem ele recebe a idade média dos homens**


![alt text](https://databootcamp.nyc3.digitaloceanspaces.com/img/desafio.jpg)

In [29]:
media_mulher = titanic[titanic.Sex == "female"].Age.mean()
media_homen = titanic[titanic.Sex == "male"].Age.mean()

print("""
Media de idade das mulheres: {}
Media de idade dos homens: {}""".format(media_mulher,media_homen))

Media de idade das mulheres: 27.915708812260537
Media de idade dos homens: 30.72664459161148

In [32]:
def preenche_idade(linha):
    idade = linha["Age"]
    sexo = linha["Sex"]
    
    if pandas.isnull(idade): #funcao padrão do pandas para verificar se na linha tem dado nulo
        
        if sexo == "female":
            return media_mulher
        else:
            return media_homen
        
    else:
        return idade
    

idades_preenchidas = titanic.apply(preenche_idade,axis=1)

print("""
Quantidade de nulos após o preenchimento: {}
""".format(idades_preenchidas.isnull().sum()))

NameError: name 'pandas' is not defined

In [ ]:
# Vamos criar a coluna idade preenchida pra usar o resultado do apply
titanic["AgeFillNaSexMean"] = idades_preenchidas

In [ ]:
titanic[["Age", "AgeFillNaSexMean"]]

# Salvando no trabalho :D

In [ ]:
titanic.to_csv("titanic_2_aula.csv", index=False)

In [ ]:
titanic.info()